app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "role" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["role", 1], ["updated_at", "2014-08-27 21:30:31.456203"]]
---
  def update
    @user = User.find(params[:id])
    authorize @user
    if @user.update_attributes(secure_params)